Revit 2027 API
ImageFailures Properties
The BuiltInFailures.ImageFailures type exposes the following members.
Properties
Name | Description
BadViewType |  Image Instances can't be placed in 3D Views.
InvalidHeight |  The image height must be must be no more than 30000 feet.
InvalidWidth |  The image width must be must be no more than 30000 feet.
Top
See Also
Reference
BuiltInFailures.ImageFailures Class
Autodesk.Revit.DB Namespace